benchmarks/openfoam-poiseuille-f25/decks/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    streamwiseMin
    {
        type            cyclic;
    }

    streamwiseMax
    {
        type            cyclic;
    }

    lowerWall
    {
        type            noSlip;
    }

    upperWall
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}
